IlleniumDillon/MM32F5277/PinMap/MM32_FSMC_PinMap.c
#include "MM32_FSMC_PinMap.h"

MM32_FSMC_Pin FMC_DA4_PA2   = {.periBase = 0, .port = GPIOA, .pin = P02, .af = AF12};
MM32_FSMC_Pin FMC_DA5_PA3   = {.periBase = 0, .port = GPIOA, .pin = P03, .af = AF12};
MM32_FSMC_Pin FMC_DA6_PA4   = {.periBase = 0, .port = GPIOA, .pin = P04, .af = AF12};
MM32_FSMC_Pin FMC_DA7_PA5   = {.periBase = 0, .port = GPIOA, .pin = P05, .af = AF12};

MM32_FSMC_Pin FMC_NADV_PB7  = {.periBase = 0, .port = GPIOB, .pin = P07, .af = AF12};
MM32_FSMC_Pin FMC_DA13_PB12 = {.periBase = 0, .port = GPIOB, .pin = P12, .af = AF12};
MM32_FSMC_Pin FMC_DA0_PB14  = {.periBase = 0, .port = GPIOB, .pin = P14, .af = AF12};

MM32_FSMC_Pin FMC_NWE_PC2   = {.periBase = 0, .port = GPIOC, .pin = P02, .af = AF12};
MM32_FSMC_Pin FMC_A0_PC3    = {.periBase = 0, .port = GPIOC, .pin = P03, .af = AF12};
MM32_FSMC_Pin FMC_NE4_PC4   = {.periBase = 0, .port = GPIOC, .pin = P04, .af = AF12};
MM32_FSMC_Pin FMC_NOE_PC5   = {.periBase = 0, .port = GPIOC, .pin = P05, .af = AF12};
MM32_FSMC_Pin FMC_DA1_PC6   = {.periBase = 0, .port = GPIOC, .pin = P06, .af = AF12};
MM32_FSMC_Pin FMC_DA2_PC11  = {.periBase = 0, .port = GPIOC, .pin = P11, .af = AF11};
MM32_FSMC_Pin FMC_DA3_PC12  = {.periBase = 0, .port = GPIOC, .pin = P12, .af = AF11};

MM32_FSMC_Pin FMC_DA2_PD0   = {.periBase = 0, .port = GPIOD, .pin = P00, .af = AF12};
MM32_FSMC_Pin FMC_DA3_PD1   = {.periBase = 0, .port = GPIOD, .pin = P01, .af = AF12};
MM32_FSMC_Pin FMC_NWE_PD2   = {.periBase = 0, .port = GPIOD, .pin = P02, .af = AF11};
MM32_FSMC_Pin FMC_CLK_PD3   = {.periBase = 0, .port = GPIOD, .pin = P03, .af = AF12};
MM32_FSMC_Pin FMC_NOE_PD4   = {.periBase = 0, .port = GPIOD, .pin = P04, .af = AF12};
MM32_FSMC_Pin FMC_NWE_PD5   = {.periBase = 0, .port = GPIOD, .pin = P05, .af = AF12};
MM32_FSMC_Pin FMC_NWAIT_PD6 = {.periBase = 0, .port = GPIOD, .pin = P06, .af = AF12};
MM32_FSMC_Pin FMC_NE1_PD7   = {.periBase = 0, .port = GPIOD, .pin = P07, .af = AF12};
MM32_FSMC_Pin FMC_DA13_PD8  = {.periBase = 0, .port = GPIOD, .pin = P08, .af = AF12};
MM32_FSMC_Pin FMC_DA14_PD9  = {.periBase = 0, .port = GPIOD, .pin = P09, .af = AF12};
MM32_FSMC_Pin FMC_DA15_PD10 = {.periBase = 0, .port = GPIOD, .pin = P10, .af = AF12};
MM32_FSMC_Pin FMC_A16_PD11  = {.periBase = 0, .port = GPIOD, .pin = P11, .af = AF12};
MM32_FSMC_Pin FMC_A17_PD12  = {.periBase = 0, .port = GPIOD, .pin = P12, .af = AF12};
MM32_FSMC_Pin FMC_A18_PD13  = {.periBase = 0, .port = GPIOD, .pin = P13, .af = AF12};
MM32_FSMC_Pin FMC_DA0_PD14  = {.periBase = 0, .port = GPIOD, .pin = P14, .af = AF12};
MM32_FSMC_Pin FMC_DA1_PD15  = {.periBase = 0, .port = GPIOD, .pin = P15, .af = AF12};

MM32_FSMC_Pin FMC_NBL0_PE0  = {.periBase = 0, .port = GPIOE, .pin = P00, .af = AF12};
MM32_FSMC_Pin FMC_NBL1_PE1  = {.periBase = 0, .port = GPIOE, .pin = P01, .af = AF12};
MM32_FSMC_Pin FMC_A23_PE2   = {.periBase = 0, .port = GPIOE, .pin = P02, .af = AF12};
MM32_FSMC_Pin FMC_A19_PE3   = {.periBase = 0, .port = GPIOE, .pin = P03, .af = AF12};
MM32_FSMC_Pin FMC_A20_PE4   = {.periBase = 0, .port = GPIOE, .pin = P04, .af = AF12};
MM32_FSMC_Pin FMC_A21_PE5   = {.periBase = 0, .port = GPIOE, .pin = P05, .af = AF12};
MM32_FSMC_Pin FMC_A22_PE6   = {.periBase = 0, .port = GPIOE, .pin = P06, .af = AF12};
MM32_FSMC_Pin FMC_DA4_PE7   = {.periBase = 0, .port = GPIOE, .pin = P07, .af = AF12};
MM32_FSMC_Pin FMC_DA5_PE8   = {.periBase = 0, .port = GPIOE, .pin = P08, .af = AF12};
MM32_FSMC_Pin FMC_DA6_PE9   = {.periBase = 0, .port = GPIOE, .pin = P09, .af = AF12};
MM32_FSMC_Pin FMC_DA7_PE10  = {.periBase = 0, .port = GPIOE, .pin = P10, .af = AF12};
MM32_FSMC_Pin FMC_DA8_PE11  = {.periBase = 0, .port = GPIOE, .pin = P11, .af = AF12};
MM32_FSMC_Pin FMC_DA9_PE12  = {.periBase = 0, .port = GPIOE, .pin = P12, .af = AF12};
MM32_FSMC_Pin FMC_DA10_PE13 = {.periBase = 0, .port = GPIOE, .pin = P13, .af = AF12};
MM32_FSMC_Pin FMC_DA11_PE14 = {.periBase = 0, .port = GPIOE, .pin = P14, .af = AF12};
MM32_FSMC_Pin FMC_DA12_PE15 = {.periBase = 0, .port = GPIOE, .pin = P15, .af = AF12};

MM32_FSMC_Pin FMC_A0_PF0    = {.periBase = 0, .port = GPIOF, .pin = P00, .af = AF12};
MM32_FSMC_Pin FMC_A1_PF1    = {.periBase = 0, .port = GPIOF, .pin = P01, .af = AF12};
MM32_FSMC_Pin FMC_A2_PF2    = {.periBase = 0, .port = GPIOF, .pin = P02, .af = AF12};
MM32_FSMC_Pin FMC_A3_PF3    = {.periBase = 0, .port = GPIOF, .pin = P03, .af = AF12};
MM32_FSMC_Pin FMC_A4_PF4    = {.periBase = 0, .port = GPIOF, .pin = P04, .af = AF12};
MM32_FSMC_Pin FMC_A5_PF5    = {.periBase = 0, .port = GPIOF, .pin = P05, .af = AF12};
MM32_FSMC_Pin FMC_A6_PF12   = {.periBase = 0, .port = GPIOF, .pin = P12, .af = AF12};
MM32_FSMC_Pin FMC_A7_PF13   = {.periBase = 0, .port = GPIOF, .pin = P13, .af = AF12};
MM32_FSMC_Pin FMC_A8_PF14   = {.periBase = 0, .port = GPIOF, .pin = P14, .af = AF12};
MM32_FSMC_Pin FMC_A9_PF15   = {.periBase = 0, .port = GPIOF, .pin = P15, .af = AF12};

MM32_FSMC_Pin FMC_A10_PG0   = {.periBase = 0, .port = GPIOG, .pin = P00, .af = AF12};
MM32_FSMC_Pin FMC_A11_PG1   = {.periBase = 0, .port = GPIOG, .pin = P01, .af = AF12};
MM32_FSMC_Pin FMC_A12_PG2   = {.periBase = 0, .port = GPIOG, .pin = P02, .af = AF12};
MM32_FSMC_Pin FMC_A13_PG3   = {.periBase = 0, .port = GPIOG, .pin = P03, .af = AF12};
MM32_FSMC_Pin FMC_A14_PG4   = {.periBase = 0, .port = GPIOG, .pin = P04, .af = AF12};
MM32_FSMC_Pin FMC_A15_PG5   = {.periBase = 0, .port = GPIOG, .pin = P05, .af = AF12};
MM32_FSMC_Pin FMC_NE2_PG9   = {.periBase = 0, .port = GPIOG, .pin = P09, .af = AF12};
MM32_FSMC_Pin FMC_NE3_PG10  = {.periBase = 0, .port = GPIOG, .pin = P10, .af = AF12};
MM32_FSMC_Pin FMC_NE4_PG12  = {.periBase = 0, .port = GPIOG, .pin = P12, .af = AF12};
MM32_FSMC_Pin FMC_A24_PG13  = {.periBase = 0, .port = GPIOG, .pin = P13, .af = AF12};
MM32_FSMC_Pin FMC_A25_PG14  = {.periBase = 0, .port = GPIOG, .pin = P14, .af = AF12};

